---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RailPlacedOutsideOfHost
source: html/eee59a5c-b5c2-1a9a-6844-b588c984a862.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RailPlacedOutsideOfHost Property

Railings are placed completely outside the host. It may change the adjustment of the railing to the host and its vertical position.

## Syntax (C#)
```csharp
public static FailureDefinitionId RailPlacedOutsideOfHost { get; }
```